[
{"title": "#RAREis Scholarship Fund", "deadline": "May 6, 2022", "description": "The AbbVie Immunology Scholarship is designed to provide financial support for exceptional students living with chronic inflammatory diseases. Scholarships of up to $15,000 each will be awarded, dependent upon type of degree pursued. Applicants must be legal residents of the U.S. and diagnosed by a healthcare professional with one of the following: ankylosing spondylitis (AS), Crohn’s disease (CD), hidradenitis suppurativa (HS), juvenile idiopathic arthritis (JIA), psoriasis (Ps), psoriatic arthritis (PsA), rheumatoid arthritis (RA), ulcerative colitis (UC), or uveitis (UV).", "link": "https://learnmore.scholarsapply.org/rareis"},
{"title": "AbbVie Immunology Scholarship", "deadline": "December 8, 2021", "description": "Qualified applicants must plan to enroll in full-time undergraduate (associate’s, bachelor’s) or graduate (master’s, MD, JD, doctorate) study at an accredited two- or four-year college, university or vocational-technical school in the U.S. for the entire upcoming academic year. Scholarships will be awarded based on academic excellence, community involvement, and ability to serve as a positive role model in the immunology community.", "link": "https://abbvieimmunologyscholarship.com"},
{"title": "Adobe Research Ph.D. Fellowship", "deadline": "September 15, 2021", "description": "Adobe Research creates innovative technologies to better serve consumers, creative professionals, developers, and enterprises. The Adobe Research Fellowship recognizes outstanding graduate students anywhere in the world carrying out exceptional research in areas of computer science important to Adobe.", "link": "https://research.adobe.com/fellowship/"},
{"title": "Adobe Research Women-in-Technology Scholarship", "deadline": "September 15, 2021", "description": "The fellowship provides $10,000 awards to current graduate students who plan to enroll in full-time Ph.D. study during the entire 2021-22 and 2022-23 academic years; fellows also receive a Creative Cloud subscription membership for one year and an opportunity to interview for an internship at Adobe.", "link": "https://research.adobe.com/scholarship/"},
{"title": "Amazon Future Engineer Scholarship", "deadline": "February 17, 2022", "description": "Applicants must be currently registered as full-time graduate students, and will be asked to submit a resume, research overview and three letters of recommendation.", "link": "https://learnmore.scholarsapply.org/amazonfutureengineer/"},
{"title": "AMETEK Foundation, Inc. International STEM Scholarship", "deadline": "May 26, 2022", "description": "Only the first 250 qualified applications will be accepted. Visit the ", "link": "https://learnmore.scholarsapply.org/ametekfoundation/"},
{"title": "AppZen STEM Scholarship for Racial Justice", "deadline": "January 31, 2022", "description": " for more detailed eligibility requirements and to start your application.", "link": "https://learnmore.scholarsapply.org/appzen/"},
{"title": "Axalta Bright Futures Scholarship", "deadline": "May 20, 2022", "description": "Adobe Research creates innovative technologies to better serve consumers, creative professionals, developers, and enterprises—and they believe that part of creating the best products is bringing a diverse group of talented people together. To bring more gender diversity to the technology industry, the company invites qualified undergraduate and master’s-level students to apply for the Adobe Research Women-in-Technology Scholarship.", "link": "https://learnmore.scholarsapply.org/axalta/"},
{"title": "Bennett Clayton Foundation Scholarship Program", "deadline": "March 1, 2022", "description": "This scholarship provides $10,000 awards to outstanding female undergraduate and master’s students studying artificial intelligence/machine learning, data science, computer science or mobile/web development at North American universities (including Canada and Mexico). Scholarship recipients also receive a Creative Cloud subscription membership for one year and an opportunity to interview for an internship at Adobe.", "link": "https://scholarshipamerica.org/wp-content/uploads/2019/05/BCF_BROCHURE_APP.pdf"},
{"title": "Book Industry Charitable Foundation (Binc) Scholarship Program", "deadline": "April 14, 2022", "description": "Only the first 250 qualified applications will be accepted. Visit the ", "link": "https://learnmore.scholarsapply.org/binc/"},
{"title": "Bristol-Myers Squibb Scholarship for Cancer Survivors", "deadline": "April 7, 2022", "description": " for more detailed eligibility requirements and to start your application.", "link": "http://learnmore.scholarsapply.org/cancer-survivors"},
{"title": "BURGER KING Scholars Program", "deadline": "December 15, 2021", "description": "The ", "link": "https://burgerking.scholarsapply.org/"},
{"title": "Northwestern Mutual Childhood Cancer Survivor Scholarship", "deadline": "February 1, 2022", "description": "The O’Brien-Vrba Scholarship Trust is providing renewable scholarships to college upperclassmen and graduate students who attended high school or currently live in rural Illinois, Indiana, Iowa, Wisconsin and Michigan communities.", "link": "http://learnmore.scholarsapply.org/nmsurvivors"},
{"title": "O’Brien-Vrba Scholarship Trust", "deadline": "April 13, 2022", "description": "Applicants must be collegiate juniors, seniors or graduate level students who are actively involved in school activities and community service, and who have a minimum grade point average of 3.0 on a 4.0 scale (or its equivalent). To be eligible, students must currently live or have resided during high school in a rural county in one of the states listed above. Please see the list of eligible rural counties ", "link": "https://learnmore.scholarsapply.org/obrien/"},
{"title": "Olson-Anderson Owatonna Clinic Scholarship Program", "deadline": "April 14, 2022", "description": ", as compiled by the Federal Office of Rural Health Policy. (Applicants who attended high school in DeKalb County, Illinois, shall be considered to have fulfilled the rural residency requirement.) Applicants of the Catholic faith are encouraged.", "link": "https://www.mayoclinichealthsystem.org/locations/Owatonna/student-opportunities/scholarships"},
{"title": "OTR Capital Diversity in Business Scholarship", "deadline": "May 25, 2022", "description": "Recipients of the O’Brien-Vrba Scholarship must be planning to enroll in full-time postsecondary or postgraduate study for the entire upcoming academic year; the scholarship may be renewable for one additional year or until a degree is earned, whichever occurs first.", "link": "https://learnmore.scholarsapply.org/otrcapital-diversity/"},
{"title": "Pega Scholars Program", "deadline": "September 30, 2021", "description": "Are you a current or previous resident of Owatonna, Minnesota, or Steele County, Minnesota, or someone who works or has worked in Owatonna or Steele County, Minnesota? Do you have an immediate family member who lives or has lived or works or has worked in Owatonna or Steele County, Minnesota?", "link": "https://learnmore.scholarsapply.org/pegascholars/"},
{"title": "PepsiCo Foundation S.M.I.L.E. Scholarship", "deadline": "one or more", "description": "If you meet any of those criteria and you’re pursuing a medical-related education program for the entire 2022-23 academic year, apply now for the Olson-Anderson Owatonna Clinic Scholarship Program!", "link": "https://learnmore.scholarsapply.org/pepsicosmile/"},
{"title": "PG&E Better Together STEM Scholarship", "deadline": "February 24, 2022", "description": "Up to 12 $1,000 scholarships will be granted for undergraduate and graduate study at accredited two-year or four-year colleges, universities or vocational-technical schools. There is no GPA requirement and financial need is not considered.", "link": "https://www.pge.com/en_US/residential/in-your-community/education-programs/grants-and-scholarships/scholarship-opportunities/scholarship-opportunities.page?WT.mc_id=Vanity_scholarships"},
{"title": "PGA WORKS Golf Management University Scholarship Program", "deadline": "June 1, 2022", "description": "OTR Capital’s Diversity in Business Scholarship is providing $2,800 scholarship awards to college undergraduates from traditionally underserved populations in Georgia and Tennessee.", "link": "https://learnmore.scholarsapply.org/pgaworks"},
{"title": "PlaceWorks Scholarship Program", "deadline": "January 27, 2022", "description": "To apply, you must be a current undergraduate student who plans to enroll in full-time undergraduate study at an accredited two- or four-year college or university for the entire upcoming academic year, and you must self-identify as one or more of the following:", "link": "https://learnmore.scholarsapply.org/placeworks/"},
{"title": "PREA Scholarship Program", "deadline": "September 13, 2021", "description": "Applicants must be current high school/secondary school graduates or current university students pursuing a degree in Computer Science, Technology, or a related field, and must plan to enroll in part-time or full-time undergraduate study at a 2-, 3-, or 4-year accredited institution for the entire next semester.", "link": "https://learnmore.scholarsapply.org/prea/"},
{"title": "Rent-A-Center Make a Difference Scholarship", "deadline": "May 19, 2022", "description": "Applicants must reside in one of the following countries:", "link": "https://learnmore.scholarsapply.org/makeadifference/"},
{"title": "Richard and Louise Varco Scholarship Fund", "deadline": "April 1, 2022", "description": "All applicants must self-identify with ", "link": "https://learnmore.scholarsapply.org/varco/"},
{"title": "James L. and Nellie M. Westlake Scholarship Program", "deadline": "February 1, 2022", "description": "The James L. and Nellie M. Westlake Scholarship program is awarding renewable, full-tuition scholarships plus a stipend for books and supplies for students in Missouri who plan to pursue a bachelor’s degree and have financial need.", "link": "https://learnmore.scholarsapply.org/westlake/"},
{"title": "James Madison Memorial Fellowship Program", "deadline": "March 1, 2022", "description": "To apply, students must be Missouri residents and be high school seniors with a cumulative GPA of 2.5 or higher on a 4.0 scale or, community college students with one year transferable credits with a GPA of 2.25 or higher on a 4.0 scale.", "link": "https://www.jamesmadison.gov/"},
{"title": "Kia Great Unknowns Scholarship", "deadline": "April 29, 2022", "description": "The James Madison Memorial Fellowship is a federal program that offers secondary level teachers (both pre-service and in-service) of history and government up to $24,000 to complete a master’s degree in history, political science, or related fields.", "link": "https://learnmore.scholarsapply.org/kia/"},
{"title": "Knoll Diversity Advancement Design Scholarships for Black Students", "deadline": "January 28, 2022", "description": "To be eligible, you must be, or plan to become, a teacher of American history, American government, or any other social studies class, teaching topics on the Constitution at the secondary school level (grades 7–12). In addition, you must be a U.S. citizen and either possess a bachelor’s degree, or plan to receive a bachelor’s degree no later than August 31 of the year in which you are applying.", "link": "https://learnmore.scholarsapply.org/knolldiversity/"},
{"title": "Lockheed Martin STEM Scholarship", "deadline": "April 1, 2022", "description": "In addition to receiving financial assistance for a master’s degree program, Fellows will have the unique opportunity to attend an intensive summer institute to strengthen their knowledge of the origins and development of American constitutional government.", "link": "https://lockheedmartin.com/scholarship"},
{"title": "Lockheed Martin Vocational Scholarship", "deadline": "March 17, 2022", "description": " ", "link": "https://lockheedmartin.com/vocational"},
{"title": "NANOG Scholarship Program", "deadline": "May 17, 2022", "description": "A first of its kind in the United States aerospace and defense industry, the Lockheed Martin Vocational Scholarship Program is geared towards students with a high school degree or GED equivalent who are pursuing associate degree, credit-bearing certificate or industry certification. The scholarship funds study at accredited eligible schools to prepare students for careers in technology and advanced manufacturing.", "link": "https://learnmore.scholarsapply.org/nanog/"},
{"title": "National Hydropower Association Past Presidents’ Legacy Scholarship Program", "deadline": "February 15, 2022", "description": "Up to 150 awards are available, for a maximum of $6,600 each.", "link": "https://www.hydro.org/awards/past-presidents-legacy-scholarship/"},
{"title": "Navisite’s Next Steminist Scholarship Program", "deadline": "May 16, 2022", "description": "To apply, students must be high school seniors, high school graduates (or GED equivalent) or undergraduates with less than a bachelor’s degree. Applicants must be U.S. citizens, and be enrolled or planning to enroll part-time or full-time in a specified area of study at an accredited vocational technical school, trade school, two-year community or state college. Finally, applicants must be pursuing an associate degree, credit-bearing certificate or industry certification in one of the ", "link": "https://www.navisite.com/navisites-next-steminist/"},
{"title": "Steiner Family Scholarship", "deadline": "March 2, 2022", "description": "The Takeoff Scholarship Program is providing $10,000 awards to eligible college undergraduates in Alabama, Georgia, North Carolina, South Carolina and Tennessee.", "link": "https://learnmore.scholarsapply.org/steinerfamilyscholarship/"},
{"title": "Takeoff Scholarship Program", "deadline": "November 15, 2022", "description": "Applicants must self-identify as American Indian or Alaska Native; Black or African American; or Hispanic or Latino, must demonstrate financial need and must be residents of the listed states who have completed at least 12 college credits at the time of application.", "link": "https://learnmore.scholarsapply.org/takeoffscholars/"},
{"title": "Tampa Bay Buccaneers Foundation Girls in Football Scholarship", "deadline": "April 12, 2022", "description": "In addition, applicants must plan to enroll in full-time undergraduate study at an accredited four-year college or university for the entire upcoming academic year, pursuing a degree and future career in one of the following fields:", "link": "https://learnmore.scholarsapply.org/buccaneersgirlsinfootball/"},
{"title": "NetDocuments Work Inspired Scholarship", "deadline": "June 1, 2022", "description": "The North American Network Operators’ Group (NANOG) is the professional association for Internet engineering, architecture and operations. Their core focus is on continuous improvement of the data transmission technologies, practices, and facilities that make the Internet function. In an effort to support the next generation of network operators, NANOG is providing $10,000 scholarships to assist current undergraduate and graduate level students pursuing a degree in Computer Engineering, Computer Science, Electrical Engineering, Network Engineering or Telecommunications*.", "link": "https://learnmore.scholarsapply.org/netdocuments/"},
{"title": "Nicole V. Reed Memorial Foundation Culinary Award", "deadline": "January 17, 2022", "description": "To apply, students must plan to enroll part- or full-time in undergraduate or graduate study at an accredited two- or four-year institution for the entire upcoming academic year. Applicants must also have a minimum 3.0 grade point average on a 4.0 scale or its equivalent. Qualified students are encouraged to apply as early as possible.", "link": "https://learnmore.scholarsapply.org/nvrmf/"},
{"title": "Northwestern Mutual Childhood Cancer Sibling Scholarship", "deadline": "February 1, 2022", "description": "The National Hydropower Association Past Presidents’ Legacy Scholarship Program, sponsored by the National Hydropower Association, is open to current college sophomores or juniors who will be juniors or seniors beginning in the fall; or graduate students; with a minimum cumulative GPA of 3.0 on a 4.0 scale (or equivalent), who are enrolled in a full-time undergraduate or graduate course of study at an accredited four-year college or university. Applicants must be United States citizens or legal residents. Applicants must be pursuing a program of study, approved by the National Hydropower Association, that is related to the hydropower industry.", "link": "https://learnmore.scholarsapply.org/nmsibling"},
{"title": "TE Connectivity African Heritage Scholarship Program", "deadline": "October 4, 2021", "description": "The TE Connectivity African Heritage Scholarship Program provides a unique two-year experience involving both a paid summer internship and a scholarship of up to $22,500.", "link": "https://learnmore.scholarsapply.org/teconnectivity-african-heritage/"},
{"title": "THOTCON Future Hacker Scholarship", "deadline": "Application deadline extended to October 4!", "description": "Eligible applicants must be college sophomores who self-identify as Black or African American or multiracial*, and must be pursuing a degree in Science, Technology, Engineering, Mathematics (STEM), Operations Management, Supply Chain, Finance or Information Technology.", "link": "https://learnmore.scholarsapply.org/thotcon"},
{"title": "Trane Technician of the Future Scholarship", "deadline": "February 4, 2022", "description": "Fourteen recipients will be invited to complete summer paid internships in 2022 with TE Connectivity; scholarship funds will be awarded in the fall after the internship. Applicants must have a minimum GPA of 3.0 on a 4.0 scale (or its equivalent), and must demonstrate financial need.", "link": "https://learnmore.scholarsapply.org/tranetechnician/"},
{"title": "US Foods Scholars Program", "deadline": "May 4, 2022", "description": "Are you a high school senior in a Chicago Public School? Do you enjoy breaking software, security controls and physical things to understand how they work? If so, the THOTCON Future Hacker Scholarship might be for you.", "link": "https://learnmore.scholarsapply.org/usfoods"},
{"title": "Varicent EDGE Scholarship", "deadline": "May 11, 2022", "description": "This is a $5,000 award designed to help a future hacker with their higher education ambitions. To apply, you must be a CPS high school senior planning on full-time undergraduate study at a two- or four-year school next year. You must be planning to pursue a major related to cyber security (computer science, computer engineering, information systems with a security concentration, etc) and demonstrate financial need.", "link": "https://learnmore.scholarsapply.org/varicentedge/"},
{"title": "Voya Financial Services Diversity Scholarship Program", "deadline": "April 4, 2022", "description": "In addition to the scholarship award, the recipient will be invited and honored at the next THOTCON gathering!", "link": "https://learnmore.scholarsapply.org/voya-im-diversity-scholarship/"},
{"title": "Voya Unsung Heroes Awards Program", "deadline": "June 15, 2022", "description": " has established a scholarship program to assist students at Morehouse College or Spelman College who are interested in pursuing a career in the financial services industry. Up to two awards of $10,000 each will be granted, with one going to a student at Morehouse College and one to a student at Spelman College.", "link": "https://www.voya.com/page/voya-unsung-heroesr"},
{"title": "We Stand Together College Scholarship", "deadline": "June 1, 2022", "description": "To apply, you must:", "link": "https://learnmore.scholarsapply.org/stridewestandtogether/"},
{"title": "ETS Cares Scholarship Program", "deadline": "May 4, 2022", "description": "The ETS Cares Scholarship Program, funded entirely by ETS employee donations, provides scholarships to high school seniors in New Jersey who are experiencing hardships that may stand in the way of their college goals.", "link": "https://learnmore.scholarsapply.org/etscares"},
{"title": "Families of Freedom Scholarship Fund", "deadline": "Ongoing", "description": "Awards range from $1,000 to $10,000, depending on students’ financial need. To apply, you must be a New Jersey public high school senior planning to enroll full-time at an accredited, nonprofit two- or four-year college in the 2021-22 school year.", "link": "http://familiesoffreedom.org"},
{"title": "Future of School Scholarship Program", "deadline": "March 15, 2022", "description": "The terrorist attacks on September 11, 2001 left the nation and the world in shock. Through the generosity of individuals and corporations, more than $108 million has been raised to fund this long-term scholarship program.", "link": "https://learnmore.scholarsapply.org/fos-scholarship/"},
{"title": "Wellroot Family Services Scholarship Program", "deadline": "K-12 educators", "description": "In addition to the scholarship, recipients will be paired with a mentor from Voya Investment Management, and will be offered an internship at Voya between their junior and senior year. The scholarship is renewable for one year or until a bachelor’s degree is earned, whichever occurs first.", "link": "https://learnmore.scholarsapply.org/wellrootscholarship/"},
{"title": "GE-Reagan Foundation Scholarship Program", "deadline": "January 10, 2022", "description": "Along with Lumina Foundation, Scholarship America created the Families of Freedom Scholarship Fund to provide education assistance for postsecondary study to financially needy dependents of those killed or permanently disabled as a result of the September 11, 2001 attacks. Scholarship America will administer the Families of Freedom Scholarship Fund to eligible families through the year 2030. Please visit the Families of Freedom Scholarship Fund website to learn more and to meet just a few of the more than 3,100 students we’ve helped so far.", "link": "https://www.reaganfoundation.org/education/scholarship-programs/ge-reagan-foundation-scholarship-program/"},
{"title": "Gionandrea Pugi Scholarship", "deadline": "May 12, 2022", "description": "The Future of School Scholarship Program is awarding scholarships of up to $10,000 to students who have embraced technology to improve their educational experiences, both academically and personally.", "link": "https://learnmore.scholarsapply.org/pugi"},
{"title": "GoodRx Pharmacy Innovation Scholarship", "deadline": "May 4, 2022", "description": "To apply, students must be high school seniors who have completed a minimum of five blended or online courses during the last two years of high school. Applicants must demonstrate academic achievement or improvement as a direct result of their enrollment in the blended/online learning curriculum. Applicants must also be planning to enroll in full-time undergraduate study at an accredited two- or four-year college, university or vocational-technical school for the entire upcoming academic year.", "link": "https://www.goodrx.com/scholarship"},
{"title": "GoodRx Scholarship for Future Black Physicians", "deadline": "May 18, 2022", "description": "To be eligible, applicants must have been enrolled in a previously-established online or blended curriculum prior to January 2020, not as a result of distance or hybrid learning due to COVID-19.", "link": "https://learnmore.scholarsapply.org/futureblackphysicians/"},
{"title": "Chia Family Foundation Scholarship", "deadline": "January 19, 2022", "description": "The Church Mutual Religious Scholars Program, established by CM CARES, is offering 50 scholarships of $5,000 each to the religious leaders of tomorrow, totaling $250,000 to assist students pursuing an advanced degree in religious studies.", "link": "https://learnmore.scholarsapply.org/chiafamily"},
{"title": "CM Cares Religious Scholar Program", "deadline": "April 5, 2022", "description": "To apply, students must be enrolled in a full-time, advanced degree religious studies program at an accredited theological seminary, college or university of higher learning in the United States for the entire 2021-22 academic year. Applicants must have a minimum GPA of 3.0 on a 4.0 scale (or its equivalent), and must demonstrate personal impact through their education, work experiences, and volunteerism.", "link": "https://learnmore.scholarsapply.org/cmcares-scholars/"},
{"title": "CME Group Foundation Scholarship", "deadline": "April 1, 2022", "description": "In addition, applicants must be committed to entering the practice of full-time ministry in the United States following completion of studies — including leading a denominational congregation, or worship group, or serving in religious leadership at a house of worship. Religious students of all denominations are encouraged to apply.", "link": "https://learnmore.scholarsapply.org/cme-scholars"},
{"title": "HACEMOS Scholarship Program", "deadline": "March 2, 2022", "description": "The ", "link": "https://learnmore.scholarsapply.org/hacemos/"},
{"title": "Henkel Diversity Scholarship", "deadline": "March 17, 2022", "description": " offers $10,000 renewable scholarships — up to $40,000 each — to numerous students annually. This national program is open to current high school seniors who demonstrate leadership, drive, integrity, and citizenship similar to that of our nation’s 40", "link": "https://learnmore.scholarsapply.org/henkeldiversity/"},
{"title": "Howard Hughes Corporation Community Scholarship", "deadline": "May 17, 2022", "description": " President. Scholars are invited to participate in a special awards program and receive ongoing leadership-development support in college and beyond.", "link": "https://learnmore.scholarsapply.org/howardhughes/"},
{"title": "ICMA-RC Public Employee Memorial Scholarship Fund", "deadline": "March 15, 2022", "description": "The Gionandrea Pugi Scholarship is providing up to two renewable awards of $5,000 each. Awards will be granted to currently enrolled college undergraduates of Italian descent, who are planning to continue full-time study at an accredited two-or four-year college, university, or vocational technical college for the entire 2021-22 academic year in the field of medicine (such as taking courses in preparation for Medical or Nursing School) or biology.", "link": "http://www.icmarc.org/prebuilt/micro/vantagescholar/"},
{"title": "Cory L. Richards Memorial Scholarship Program, sponsored by the Guttmacher Institute", "deadline": "May 15, 2022", "description": "Up to fifty (50) awards will be granted; awards are one-time only and not renewable.", "link": "http://www.guttmacher.org/richardsscholarship/"},
{"title": "David Pruitt Award for Courage", "deadline": "April 7, 2022", "description": "The Cory L. Richards Memorial Scholarship Program is open to graduate students who are pursuing a Masters Degree in the field of Public Policy or Public Health and demonstrate a commitment to advancing public policy related to sexual and reproductive rights. Applicants must have a minimum grade point average of 3.0 on a 4.0 scale (or its equivalent) to apply.", "link": "https://learnmore.scholarsapply.org/courage/"},
{"title": "DEWALT Trades Scholarship", "deadline": "December 13, 2021", "description": "One individual will be designated each year as a Cory Richards Scholar and awarded a one-time scholarship of $15,000 to support full-time graduate study at an accredited institution in the United States.", "link": "https://learnmore.scholarsapply.org/dewalttrade"},
{"title": "Dr Pepper Tuition Giveaway", "deadline": " ", "description": "The individual will be selected based on academic performance, demonstrated leadership and participation in school and community activities, work experience, an essay, unusual personal or family circumstances, and an outside appraisal completed by a professor, advisor or mentor. Financial need will also be considered.", "link": "https://www.drpeppertuition.com/"},
{"title": "International Bridge, Tunnel and Turnpike Association Scholarship Program ", "deadline": "April 18, 2022", "description": "According to the ", "link": "https://learnmore.scholarsapply.org/ibtta"},
{"title": "Dr. Michael and Mrs. Kay Wilcox Education Fund", "deadline": "October 17, 2021", "description": "Every student deserves a chance to realize their potential. That’s why Dr Pepper is giving away $2 million this year to help students across the country pursue their dreams.", "link": "https://learnmore.scholarsapply.org/wilcox/"},
{"title": "Dunkin’ Philadelphia Regional Scholarship Program", "deadline": "February 9, 2022", "description": "Since 2008, the Dr Pepper Tuition Giveaway Promotion and Contest has changed lives by giving away millions of dollars in tuition. With the challenges of rising tuition costs and studying full-time, Dr Pepper takes pride in helping students achieve their goals.", "link": "https://learnmore.scholarsapply.org/dunkinphilly/"},
{"title": "Educating America Scholarship Program", "deadline": "April 29, 2022", "description": "If you’re a student between the ages of 18-24, you can create a profile, submit your goal and upload a video to be considered—and if you know an 18-24-year-old who could use a boost, you can nominate them as well! National winners can earn up to $125,000 in tuition!", "link": "https://learnmore.scholarsapply.org/educatingamerica/"},
{"title": "Edwards Lifesciences Scholarship Program", "deadline": "December 6, 2021", "description": "The Dr. Michael and Mrs. Kay Wilcox Education Fund is providing renewable scholarships for undergraduate study in approved health care-related fields. Applicants must be high school seniors or graduates from New Prague High School in New Prague, Minnesota.", "link": "https://learnmore.scholarsapply.org/edwards/"},
{"title": "Equitable Excellence Scholarship", "deadline": "April 19, 2022", "description": "Students who receive awards from the Fund must be planning to enroll in an approved health care-related undergraduate field at an accredited two year or four year college, university or vocational-technical school for the entire upcoming academic year. After graduation, recipients are expected to work in a ", "link": "https://learnmore.scholarsapply.org/equitableexcellence/"},
{"title": "Richard O. Jacobson Legacy Scholarship", "deadline": "March 24, 2022", "description": "The Richard O. Jacobson Legacy Scholarship Program is offering approximately 50 renewable scholarships of up to $10,000 to high school seniors and current college undergraduates at eligible Iowa colleges and universities.", "link": "https://learnmore.scholarsapply.org/jacobson"},
{"title": "RISE Financial Progress Scholarship Program", "deadline": "May 2, 2022", "description": "Awards are renewable for up to three years or until a bachelor’s degree is earned, whichever occurs first, provided the recipient maintains a cumulative grade point average of 2.0 on a 4.0 scale. Applicants must be Iowa residents pursuing their first associate’s or bachelor’s degree, or vocational/technical certificate, and must be planning to enroll full-time at an eligible Iowa college or university for the entire 2022-23 academic year. Financial need will be considered.", "link": "https://www.risecredit.com/rise-scholarship"},
{"title": "Risk Management Association Foundation (RMA) Scholarship Program", "deadline": "March 31, 2022", "description": "Through the Robert E. Applebaum Scholarship Fund, The Saint Paul & Minnesota Community Foundations are offering scholarships of up to $12,500 to applicants who demonstrate high achievement and financial need. This unique program is open to students who will be attending an accredited ", "link": "https://landing.rmahq.org/SRC/scholarships-94UZ-1982TH.html"},
{"title": "Robert E. Applebaum Scholarship Fund", "deadline": "February 10, 2022", "description": " college or university, as either a senior in college or a graduate school student for the entire upcoming academic year. Applicants must also have a minimum grade point average of 3.0 on a 4.0 scale (or its equivalent).", "link": "https://learnmore.scholarsapply.org/applebaum/"},
{"title": "Rock the Trades Scholarship", "deadline": "Minnesota", "description": "The authorized distribution of awards will be determined by The Saint Paul & Minnesota Community Foundations at the time awards are chosen, based on the total amount available for distribution from the Robert E. Applebaum Scholarship Fund.", "link": "https://rockthetrades.com/scholarship/"},
{"title": "Roy F. and Joann Cole Mitte Foundation Scholarship", "deadline": "September 27, 2021", "description": "The Roy F. and Joann Cole Mitte Foundation is offering up to $100,000 in scholarships to students from eligible Texas counties (as listed on the application site), who plan to attend college in the state. Applicants must be high school seniors with a minimum 3.0 GPA (on a 4.0 scale), and must be planning to enroll full-time at an accredited two- or four-year college in Texas for the full upcoming academic year.", "link": "https://learnmore.scholarsapply.org/mittefoundation"},
{"title": "Scholarship America Dream Award", "deadline": "March 17, 2022", "description": "Renewable scholarships of $10,000 will be granted for students attending four-year colleges, and $5,000 for students attending two-year colleges.", "link": "https://learnmore.scholarsapply.org/dreamaward/"},
{"title": "Scorpion Cares Scholarship Program", "deadline": "October 15, 2021", "description": "Scholarship America’s Dream Award is a renewable scholarship fund targeted toward completion. Awards will be given to students entering their second year or higher of education beyond high school, based on the fact that too often scholarships are only offered in their freshman year. Award amounts will grow each year, helping ensure that students can afford to complete their degrees.", "link": "https://learnmore.scholarsapply.org/scorpion/"},
{"title": "ScottMadden Inspire Scholarship", "deadline": "April 11, 2022", "description": "Dream Award scholarships for 2021-22 include general scholarships, STEM-specific scholarships (for study in science, technology, engineering and math-related majors), the ", "link": "https://learnmore.scholarsapply.org/scottmadden/"},
{"title": "Simpson Strong-Tie Structural & Civil Engineering/Construction Management/Architecture Scholarship", "deadline": "January 20, 2022", "description": " Dream Award Scholarship for Chinese American students and the Midwest Scholars Dream Award for students in eligible states. Financial need will be considered in determining award amounts.", "link": "https://learnmore.scholarsapply.org/sst/"},
{"title": "SMART Scholarship Program", "deadline": "March 15, 2022", "description": "To qualify, students must have received a high school diploma or equivalent from a U.S. school, and must be planning to complete a minimum of one full year of postsecondary education by the end of the 2021-22 year. Applicants must plan to enroll in full-time undergraduate study at the sophomore-year level or higher at an accredited two- or four-year college, university or vocational-technical school in the United States for the entire 2022-23 academic year, and must have a minimum cumulative grade point average of 3.0 on a 4.0 scale (or its equivalent). Finally, applicants must be U.S. citizens, U.S. permanent resident (holders of a Permanent Resident Card), or individuals granted deferred action status under the Deferred Action for Childhood Arrivals Program (DACA).", "link": "https://smartscholarshipprod.servicenowservices.com/smart"},
{"title": "STANLEY Technology Scholarship Program", "deadline": "December 1, 2021", "description": "Simpson Strong-Tie", "link": "https://apply.scholarsapply.org/stanley-scholarship/"}
]
